<a href="https://colab.research.google.com/github/werowe/HypatiaAcademy/blob/master/class/2024_10_04_sql_football.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3
conn = sqlite3.connect('football_team.db')
cursor = conn.cursor()
cursor.execute('''
CREATE TABLE IF NOT EXISTS football_team (
    player_id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age INTEGER,
    favorite_food TEXT
)
''')
players = [
    ('ABC DEF', 25, 'Pasta'),
    ('GHI JKL', 22, 'Sushi'),
    ('MNO PQR', 28, 'Pizza')
]
cursor.executemany('''
INSERT INTO football_team (name, age, favorite_food)
VALUES (?, ?, ?)
''', players)
print("Список всех игроков команды:")
cursor.execute('SELECT * FROM football_team')
rows = cursor.fetchall()
for row in rows:
    print(row)
print("\nПоиск GHI JKL:")
cursor.execute('SELECT * FROM football_team WHERE name = ?', ('GHI JKL',))
rows = cursor.fetchall()
for row in rows:
    print(row)
cursor.execute('''
UPDATE football_team
SET favorite_food = ?
WHERE name = ?
''', ('Burger', 'ABC DEF'))
print("\nДанные после обновления любимой еды для ABC DEF:")
cursor.execute('SELECT * FROM football_team WHERE name = ?', ('ABC DEF',))
rows = cursor.fetchall()
for row in rows:
    print(row)
cursor.execute('DELETE FROM football_team WHERE name = ?', ('MNO PQR',))
print("\nДанные после удаления MNO PQR:")
cursor.execute('SELECT * FROM football_team')
rows = cursor.fetchall()
for row in rows:
    print(row)
conn.commit()
conn.close()

Список всех игроков команды:
(1, 'ABC DEF', 25, 'Pasta')
(2, 'GHI JKL', 22, 'Sushi')
(3, 'MNO PQR', 28, 'Pizza')

Поиск GHI JKL:
(2, 'GHI JKL', 22, 'Sushi')

Данные после обновления любимой еды для ABC DEF:
(1, 'ABC DEF', 25, 'Burger')

Данные после удаления MNO PQR:
(1, 'ABC DEF', 25, 'Burger')
(2, 'GHI JKL', 22, 'Sushi')

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///football_team.db

# Football

* has many players
* one team
* has many games (matches)

In [5]:
%%sql

pragma table_info(football_team);

 * sqlite:///football_team.db
Done.

[(0, 'player_id', 'INTEGER', 0, None, 1),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'age', 'INTEGER', 0, None, 0),
 (3, 'favorite_food', 'TEXT', 0, None, 0)]

In [6]:
%%sql

drop table teams

 * sqlite:///football_team.db
(sqlite3.OperationalError) no such table: teams
[SQL: drop table teams]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [7]:
%%sql

CREATE TABLE teams
  (
    team_number INTEGER PRIMARY KEY AUTOINCREMENT,
    team_name text
  );

 * sqlite:///football_team.db
Done.

[]

In [8]:
%%sql

insert into teams(team_name) values ("Real Madrid");

 * sqlite:///football_team.db
1 rows affected.

[]

In [11]:
%%sql

drop table games

 * sqlite:///football_team.db
Done.

[]

In [12]:
%%sql

CREATE TABLE games
  (
    game_number INTEGER PRIMARY KEY AUTOINCREMENT,
    team_number integer,
    opponent text,
    winner boolean,
    score text,
    date_played text
  );

 * sqlite:///football_team.db
Done.

[]

In [13]:
%%sql

select * from teams;

 * sqlite:///football_team.db
Done.

[(1, 'Real Madrid')]

In [19]:
# look up team number given team name

%%sql

INSERT INTO games (team_number, opponent, winner, score, date_played)
VALUES ((SELECT team_number FROM teams WHERE team_name = 'Real Madrid'), 'Dynamo Kviv', false, '5-4', '2020-09-22');

 * sqlite:///football_team.db
1 rows affected.

[]

In [ ]:
# hard code

%%sql

INSERT INTO games (team_number, opponent, winner, score, date_played)
VALUES (1, 'Manchester United', true, '5-4', '2020-09-23');

In [20]:
%%sql

select * from teams;

 * sqlite:///football_team.db
Done.

[(1, 'Real Madrid')]

In [21]:
%%sql

select * from games;

 * sqlite:///football_team.db
Done.

[(1, 1, 'Manchester United', 1, '5-4', '2020-09-23'),
 (2, 1, 'Manchester United', 1, '5-4', '2020-09-23'),
 (3, 1, 'Manchester United', 1, '5-4', '2020-09-23'),
 (4, 1, 'Dynamo Kviv', 0, '5-4', '2020-09-22')]